{
  "image": "../../../assets/images/Department Banner/eie.jpg",
  "about": "Electronics and Instrumentation Engineering (EIE) is a branch of engineering that focuses on the design, development, and maintenance of instrumentation systems used in various industries. It integrates principles of electronics, control systems, and automation to ensure accurate measurement, monitoring, and control of industrial processes. EIE engineers work on advanced technologies such as sensors, robotics, IoT, biomedical instrumentation, and process automation in sectors like manufacturing, healthcare, power plants, and aerospace. With the growing demand for precision and automation, the field is evolving towards smart and intelligent systems, enhancing efficiency, safety, and reliability. As industries embrace digital transformation, Electronics and Instrumentation Engineering plays a vital role in optimizing processes and driving technological advancements.",
  "dept-name": "Electronics and Instrumentation Engineering ",
  "hod_name": "Dr.S.J.Suji Prasad",
  "intake": 120,
  "phd": "-",
  
  "vision": "To become a technically competent centre in the domain of Electronics and Instrumentation Engineering to take care of the National and International needs.",
  "mission": [
      "To develop innovative, competent, efficient, disciplined and quality Electronics and Instrumentation Engineers.",
      "To produce Engineers who can participate in technical advancement and social upliftment of the country.",
      "To excel in academic and research activities by facilitating the students to explore the state- of- the- art techniques to meet the industrial needs."
  ],
  "objective": "To equip students with the necessary technical and managerial skills.",
  "peo": [
      "Excel in professional career and higher education using their fundamental knowledge in mathematical and engineering principles.",
      "Analyse, design, develop and maintain the instrumentation systems of an industry and also offer solutions that are technically feasible, economically viable and socially relevant.",
      "Exhibit Professional and Ethical code of conduct, communication skills, team work and lifelong learning to resolve societal issues."
  ],
  "po": [
    "Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and engineering specialization to the solution of complex engineering problems.",
    "Problem Analysis: Identify, formulate, research literature, and analyze engineering problems to arrive at substantiated conclusions using first principles of mathematics, natural, and engineering sciences.",
    "Design/development of solutions: Design solutions for complex engineering problems and design system components, processes to meet the specifications with consideration for the public health and safety, and the cultural, societal and environmental considerations.",
    "Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.",
    "Modern tool usage: Create, select and apply appropriate techniques, resources and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.",
    "The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.",
    "Environment and sustainability: Understand the impact of professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.",
    "Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.",
    "Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.",
    "Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.",
    "Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.",
    "Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadcast context of technological change."
  ],
  "pso": [
      "Industrial Automation: Develop an industrial instrumentation system and provide automation by using modern automation tools.",
      " Entrepreneurship: Become an entrepreneur by inculcating the skills of project management and finance with the knowledge of instrumentation technology.,"
  ],
  
    "highlights": {
      "Conferences organized": ["International - 3", "1 International and 4 National Conferences"],
      "Sponsored Seminars / Workshops / FDP organized": "4 (funded by CSIR)",
      "Publications by faculty": [
        "98 Publications in Journals",
        "40 Publications in Conferences",
        "255 Papers Published in peer-reviewed International Journals"
      ],
      "Consultancy / training activities carried out": "Rs.5.23Lakhs",
      "Consistent improvement in Placement and Internship": true,
      "Sponsored student’s projects": [
        "06 (IIT Palakkad, SPARK fund and SEED grant)",
        "08 projects funded by TNSCST"
      ],
      "MoU": [
        "Brakes India", "Wheels India", "Roots Industries", "Niyata Infotech Pvt Ltd, Bangalore", 
        "Sree Saradhambal Automobiles Pvt Ltd, Coimbatore", "Aadhi Cars Pvt Ltd, Coimbatore", "IMIK Technologies, Coimbatore",
        "Trend Instrumentation & Automation Pvt. Ltd., Chennai", "Yokogawa India Limited, Bengaluru", "VI Microsystems Pvt. Ltd., Chennai",
        "ABE Semiconductor Designs, Chennai", "Centre for Development of Advanced Computing, Thiruvananthapuram", "Micromax Technologies, Trichy",
        "Pamtrons Healthcare Devices, Mumbai", "bitsCrunch, Germany", "Silicon Systems, Coimbatore", "Kalchi Controls, Trichy",
        "ABB Global Industries and Services Ltd, Bangalore"
      ],
      "State of art laboratory facilities": true,
      "Papers presented by students": "140 and won 20 prizes, 7 prizes from MITs, NITs & other premier institutions",
      "Projects presented by students": "59 and won 25 prizes, 6 prizes from IITs.",
      "Participation in National and International Events": [
        "KPIT", "E-Kart", "Baja", "Go-kart", "E-Kart", "Aero Modelling", "Electric Two-Wheeler Design Challenge", "Bicycle Design Challenge"
      ],
      "University Ranks": "52 University Ranks including 04 Gold Medals",
      "ISOI Students’ chapter": true,
      "Seminars/Workshops": ["32 sponsored", "74 self-supporting seminar/workshops organized"],
      "Books Published": 17,
      "R&D Projects Completed": "05 R&D Projects (worth of 76.02 Lakh from DST, UGC & AICTE)",
      "Faculty International Conferences": "03 faculty members attended conferences in Malaysia & Singapore with a Travel grant of Rs. 2,68,789/- from UGC",
      "Awards": [
        "Best Department Award: 2005, 2013",
        "Best Performing Department: 2015, 2016, 2024"
      ],
      "Research": [
        "Approved Supervisors: 4",
        "Ph.D Scholars: 8",
        "Ph.D Completed: 24",
        "Thesis Submitted: 2"
      ],
      "Consultancy Activities": [
        "Trend Instrumentation & Automation",
        "Sakthi Auto Components Private Ltd.",
        "BPL India Ltd.",
        "Maharaja World Multiplex",
        "Cordite Factory"
      ],
      "Certifications": [
        "CLAD (Certified LabVIEW Associate Developer): 2",
        "CLD (Certified LabVIEW Developer): 1"
      ],
      "Notable Student Achievements": [
        "Highest Salary Package: Mr. R. Ramesharavind (2014-18) - Amazon - 27 LPA",
        "Sports Representation: Mr. R. Elangeshwaran (2015-19) - Star Sports Pro Kabaddi 2017",
        "Best Extracurricular Student: 2015, 2016",
        "N.Yogaprasanth: Represented TNP&A NCC Directorate in All India Republic Day Camp 2020",
        "S.Karthik Raj: Attended NASA Conference, USA",
        "S.Karthikraja: Cleared Civil Service Examination, Assistant Commissioner (IRS), GOI"
      ],
      "Awards & Recognitions": [
        "Best Agro Project in TAFE 2018",
        "AICTE Chhatra Vishwakarma Award - South convention 2019",
        "Best Innovator award for Agri Equipments - 2019",
        "1st position in Idea Spark 2019 by IIT, Madras",
        "Smart India Hackathon 2020 winner & 2023 winner & Runner-up in E-Summit 2020"
      ],
      "Grants Received": [
        "EDII-IVP: Rs. 2,43,000/-",
        "AICTE ATAL FDP: Rs. 93,000/-",
        "AICTE MODROBS: Rs. 11.97 Lakhs"
      ],
      "Centre of Excellence": "Industrial IoT",
      "Recent Achievements": [
        "AICTE Inventor Challenge 2023: Winner, cash prize Rs. 50,000 at New Delhi",
        "Smart India Hackathon Hardware Edition 2024: Winner, cash prize Rs. 50,000 at Galgotius University, Uttar Pradesh"
      ],
      "R&D Fund Sanctioned": "Rs.101.3 lakhs for the last three years",
      "Patents Filed": 30,
      "Energy Auditors & Managers": [
        "Energy Auditors: 4",
        "Energy Manager: 1"
      ],
      "Consultancy Revenue": "Rs.19 lakhs from 45 consultancy activities",
      "Student Paper Presentations": 383,
      "Student Funded Projects": "17 projects worth Rs. 1,39,000",
      "Student Internships": ["ABB", "BOSCH", "Lucas TVS", "Solitron"]
    },
  
    "milestones": [
      {
        "year": 2022,
        "event": [
            "Established Centre of Excellence on Industrial IoT.",
            "NBA awarded Accreditation for 3 years."
        ]
      },
      {
        "year": 2020,
        "event": "Reaccredited by NBA for 1 year."
      },
      {
        "year": 2018,
        "event": "NBA awarded Accreditation for 3 years."
      },
      {
        "year": 2016,
        "event": "NBA Accreditation extended for 1 year."
      },
      {
        "year": 2014,
        "event": " Reaccredited by NBA for 2 years."
      },
      {
        "year": 2010,
        "events": [
          " ME (CIE) Programme started with an intake of 18.",
          "Recognized as Research Centre by Anna University."
        ]
      },
      {
        "year": 2009,
        "event": " Accredited by NBA for 3 years."
      },
      {
        "year": 2008,
        "event": "Intake increased to 120."
      },
      {
        "year": 2006,
        "event": "Intake increased to 60."
      },
      {
        "year": 2004,
        "event": "Accredited by NBA for 3 years."
      },
      {
        "year": 2002,
        "event": "EIE Association ISoI Students’ Chapter."
      },
      {
        "year": 1999,
        "event": "Intake increased to 40."
      },
      {
        "year": 1998,
        "event": "B.E.(EIE) Programme started with an intake of 30."
      }
    ],

    "labs": [
      {
        "topic": "Sensors and Transducers Laboratory",
        "detail": "This Sensors and Transducers Laboratory was established in the year 1996. This lab is equipped with Speed Measurement Trainer, Temperature Transducer Trainer, Opto Electric Transducer Trainer, Strain Gauge, Load cell, Characteristics of Thermistor Kit, Low Pressure Generation Pump, PID Controller with Motor setup, LVDT Trainer kit, Cathode Ray Oscilloscopes, Electrical Rotary and Linear Actuator. Major equipments includes Venturimeters, Orifice meters, pH meters, Viscosity meters, UV-Visible Spectrophotometer, Dead Weight Tester, Thermocouple calibration setup, Differential Pressure Transmitters, Conductivity meter, Pressure to Current converter setup, Current to Pressure converter setup, Flopper nozzle setup, Ultrasonic based level measurement kit, Electromagnetic flow meter kit, Pressure measurement and Calibration using vacuum gauge, Turbidity and TDS measurement setup and Low pressure measurement using McLeod gauge, Ultrasonic flowmeter setup, Turbine flowmeter setup, Open channel weirs setup. Students do their mini projects and major projects in this lab in addition to their regular lab classes.",
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": "Microprocessor and Microcontroller laboratory",
        "detail": [
            "Microprocessor and Microcontroller laboratory was established in the year 2001, which has 8085 microprocessor, 8086 microprocessor, 8051 microcontroller trainer kits, universal programmer downloader and Tester, PIC 16F1876A, PIC 16F877A microcontroller trainer kit. It also has interfacing devices such as ADC , DAC, stepper motor controller, traffic light controller , LED display interface , Keyboard interface devices, Printer interface, RTC, Elevator simulator, 8251 and 8253 interfaces.",
            "Dual FPAA development and trainer kit, DSO, Anadigm software, ARM7 (LPC2378) processor, ARM 9 processor, ARM7 LPC2148 development board, Arduino and Raspberry Pi kits which will facilitate the researchers in the areas of analog, mixed signal, and RF design. A two user Microversion3 Keil C software is also provided for embedding the assembly language programs and high level programming languages like C."
        ],
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": " Measurements and Instrumentation Laboratory",
        "detail": "The Measurements and Instrumentation Laboratory was established in the year 2000, which covers instruments used for basic measurements like voltage, current, power and physical quantities. This lab has major equipments like 3-Phase Electronic Trivector Meter, Digital Energy Meter, Digital Spectrum Analyzer, Load Cell and Strain Gauge Trainer kit, 100 MHz Dual Trace Oscilloscope, AC and DC Servo motor, Universal Tester with LCR Meter and Digital Real-time Storage Oscilloscope. The students utilize the laboratory for designing Instrumentation systems and Electronic circuits related to their mini and capstone projects.",
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": " Computer Centre",
        "detail": "The Computer Centre was established in the year 2000, which has fully air-conditioned Computer Centre with 68 computers. This centre is utilized for developing applications based on programming languages such as C, C++, java, Python and to implement the concepts of data structures & algorithms. The computer centre is equipped with 4 printers and one scanner. Apart from C and C++, the softwares available are ORCAD Release 9.2- Single User Version, MATLAB RELEASE 13 -5 user version and MATLAB R2024 (Campus wide license). All the computers are provided with internet connectivity and the centre is kept open till 7.00 pm on all working days.",
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": "Advanced Instrumentation Laboratory",
        "detail": "The Advanced Instrumentation Laboratory was established in the year 2002, which covers the advanced instrumentation field in process automation. It is one of the core laboratory in Instrumentation engineering which includes major equipment like PLC modules (Allen-Bradley, Micrologix 1000, Micrologix 1100, Siemens Step7- 200, Siemens-Logo, GE Fanuc, Modicon, ABB, Omron, Siemens S7-1200), NI- ELVIS, DAQ card, Thermocouple and Accelerometer modules, Spartan FPGA, Spartan 6, Universal FPGA Trainer Boards and CCD Camera for Imaging applications. The laboratory is effectively utilized during working hours for conducting practical courses and doing project work for UG and PG students. Beyond the working hours, the laboratory is effectively utilized for conducting value added courses for internal students, seminars and workshops for outside participants from various institutes and industries. It provides training and technical supports to students and researchers to develop the proto type model. It is a multi-instrument resource to train and educate the undergraduate and post graduate students to develop industrial instrumentation automation systems and update their knowledge to solve the practical issues in the industry.",
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": "Distributed Control System Laboratory",
        "detail":[
             "The Distributed Control System Laboratory was established in the year 2009, which mimics the most advanced control system for the process industries. The students are given training in the state of the art Yokogawa Centum Vp DCS to expose them to the modern process industries. The installed system setup is able to control parameters like flow, level and pressure that are commonly required in industries. It includes one Engineering station and multiple operator stations for human machine interfaces which will help to create a real time process industry environment.",
             "This laboratory is equipped with Industrial type Continuous Stirred Tank Reactor (CSTR) skid and Two tank Conical Interacting and Non Interacting systems to acquire knowledge and enhance research activities for students and research scholars of Electronics and Instrumentation Engineering. It provides an opportunity to understand the concepts and control of real time Industrial Automation systems with the assistance of PLC, DCS, LabVIEW and MATLAB environments."
        ],
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": "Biomedical Instrumentation Laboratory",
        "detail": "The Biomedical Instrumentation Laboratory was established in the year 2015 to serve as a multipurpose teaching facility to support fundamental curricular objectives that include biomedical engineering concepts covered in Biomedical Engineering subject and imparted biomedical signals analysis concepts in signal processing laboratory. It includes the equipment such as, Biomedical Electrodes and Transducer, Blood Pressure Monitor, Sphygmomanometer, Pulse Oximeter, Phonocardiography, Ultra Sound Diathermy Unit, Doppler Shift Blood Flow Meter, Blood Glucose Meter, Blood Cell counter, Pacemaker, Defibrillator, Arrhythmia Simulator, Bio-Telemetry system, ECG, EEG, EMG, EOG, ERG, Respiration Rate Monitor and Audio meter. The lab includes prototype model of Heart Lung Machine, Haemodialysis Machine, Ultrasound Image Processing, Data Acquisition System, Haemoglobin Test kit and Bio telemetry module. This laboratory supports the work of advanced undergraduate, master graduate, and research scholars.",
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      },
      {
        "topic": "Research Laboratory",
        "detail": "Research Laboratory consists of advanced automation and testing instruments used in the Process Industries. This lab is equipped with Calibration Test Bench, Interacting Spherical Tank Level Control System, DPT, Siemens Variable Frequency Drive and HMI. Calibration test bench is used for Industrial Consultancy and Testing for calibration of pressure gauges, differential pressure gauges and safety valves. DPT, VFD, HMI and Spherical tank control system are utilized for various research projects.",
        "image": "https://ntpcentr.com/wp-content/uploads/automotive-lab-8.jpg"
      }
    ],
    
    "library": {
      "name": "Electronics and Instrumentation Engineering Department Library",
      "description": "Electronics and Instrumentation department library is available for the department faculty and students for immediate reference. It has text and reference books in different disciplines. It has books in various areas like Basic Electronics, Instrumentation, Process control, Measurements, Sensors & Transducers, Control Systems, Analog and Digital Electronics, VLSI Design, Neural Networks, Fuzzy logic, Microprocessor etc. The Library has different Journals like IEEMA, IETE, Computer Society of India and Magazines like Electronics for You Competition Success Review etc. It is equipped with CD ROMS, Videocassettes in various areas like Industrial automation, Microprocessor & Microcontrollers, Linear integrated circuits etc..,",
      "details": {
        "number_of_volumes": "161",
        "number_of_titles": 47,
        "number_of_project_report_cd": 30,
        "value_of_books_in_rs": "23,850.00",
        "number_of_journals_and_magazines": "12",
        "number_of_journals": "30",
        "value_of_journals_in_rs": "44,760.00",
        "working_hours": "8:40 AM to 7 PM"
      }
    },
    "rnd": {
      "academic": "https://rnd.kongu.edu/academic/eie.php",
      "activities":"https://rnd.kongu.edu/activities/eie/index.php"
    },    
  "dept_images": [
      "https://timess3spore.s3.amazonaws.com/ndata/media/Counsellor/CollegeImage/2023/04/23/1682252094.png"
  ]
}